/** Arabic- ar */
jDx.addLang('ar', {
  dir: 'rtl',
  masks:{
    'default':      "ddd d mmm yyyy HH:MM:ss",
    shortDate:      "dd/\u200Fm/\u200Fyyyy", // \u200F -> Right-to-left mark
    mediumDate:     "d mmm yyyy",
    longDate:       "d mmmm yyyy",
    fullDate:       "dddd d mmmm yyyy",
    shortTime:      "HH:MM",
    mediumTime:     "HH:MM:ss",
    longTime:       "HH:MM:ss Z",
  },
  dayNames: [
    "أحد", "إثنين", "ثلاثاء", "أربعاء", "خميس", "جمعة", "سبت", 
    "الأحد", "الإثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", 
    "ح", "ن", "ث", "ر", "خ", "ج", "س",
  ],
  monthNames: [
    'كانون الثاني يناير', 'شباط فبراير', 'آذار مارس', 'نيسان أبريل',
    'أيار مايو', 'حزيران يونيو', 'تموز يوليو', 'آب أغسطس',
    'أيلول سبتمبر', 'تشرين الأول أكتوبر', 'تشرين الثاني نوفمبر', 'كانون الأول ديسمبر',
    'كانون الثاني يناير', 'شباط فبراير', 'آذار مارس', 'نيسان أبريل',
    'أيار مايو', 'حزيران يونيو', 'تموز يوليو', 'آب أغسطس',
    'أيلول سبتمبر', 'تشرين الأول أكتوبر', 'تشرين الثاني نوفمبر', 'كانون الأول ديسمبر'
  ],
  relative: {
    future: 'بعد %s',
    past: 'منذ %s',
    // seconds: 'ثوان',
    // minute: 'دقيقة',
    // minutes: '%d دقائق',
    // hour: 'ساعة',
    // hours: '%d ساعات',
    // day: 'يوم',
    // days: '%d أيام',
    // month: 'شهر',
    // months: '%d أشهر',
    // year: 'سنة',
    // years: '%d سنوات'
  },
  meridiem: { am:'ص', pm:'م' },
  dayOf: { week:6, year:12 },
});


